ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.LPC800_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC800_DFP</name>
  <description>NXP LPC800 Series Device Support</description>

  <releases>
    <release version="1.4.0" date="2016-10-04">
      Updated LPC83x SVD file.
    </release>
    <release version="1.3.0" date="2016-09-05">
      Added LPC83x device support.
      Updated documentation.
      Corrected doxy comments is system file.
    </release>
    <release version="1.2.0" date="2015-06-26">
      Updated LPC8xx.h fixing wrong address offset for IRQ_FLAG in struct LPC_MRT_TypeDef.
    </release>
    <release version="1.1.0" date="2014-10-13">
      Added LPC82x device support.
      Added Board description, examples for LPC824-Xpresso and LPC812-Xpresso development boards.
    </release>
    <release version="1.0.1">
      Updated: Device description with features
    </release>
    <release version="1.0.0">
      First Release version of LPC800 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC800</keyword>
    <keyword>LPC8xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="LPC800 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>

      <!-- ************************  Subfamily 'LPC81x'  **************************** -->
      <subFamily DsubFamily="LPC81x">
        <processor Dclock="30000000"/>

        <book name="Documents/UM10601.pdf" title="LPC81x User manual"/>
        <book name="Documents/LPC81XM.pdf" title="LPC81x Datasheet"/>
        <description>
The LPC81x are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 30 MHz.
The LPC81x support up to 16 kB of flash memory and 4 kB of SRAM.
The peripheral complement of the LPC81x includes a CRC engine, one I2C-bus interface, up to three USARTs, up to two SPI interfaces, one multi-rate timer, self wake-up timer, and state-configurable timer, one comparator, function-configurable I/O ports through a switch matrix, an input pattern match engine, and up to 18 general-purpose I/O pins.
        </description>

        <feature type="I2C"           n="1"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="AnalogOther"   n="1"                           name="Comparator"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC810M021FN8'  ***************************** -->
        <device Dname="LPC810M021FN8">
          <compile header="Device/Include/LPC8xx.h"  define="LPC810M021FN8"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_4.FLM"  start="0x00000000" size="0x00001000" RAMstart="0x10000000" RAMsize="0x03E0" default="1"/>

          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="6"/>
          <feature type="DIP"           n="9"         name="Dual In-Line Package"/>
        </device>

        <!-- *************************  Device 'LPC811M001JDH16'  ***************************** -->
        <device Dname="LPC811M001JDH16">
          <compile header="Device/Include/LPC8xx.h"  define="LPC811M001JDH16"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_8.FLM"  start="0x00000000" size="0x00002000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="14"/>
          <feature type="SOP"           n="16"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JDH16'  ***************************** -->
        <device Dname="LPC812M101JDH16">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JDH16"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="14"/>
          <feature type="SOP"           n="16"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JD20'  ***************************** -->
        <device Dname="LPC812M101JD20">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JD20"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="PackageOther"  n="20"        name="SO Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JDH20'  ***************************** -->
        <device Dname="LPC812M101JDH20">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JDH20"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JTB16'  ***************************** -->
        <device Dname="LPC812M101JTB16">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JTB16"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="14"/>
          <feature type="PackageOther"  n="16"        name="SON Package"/>
        </device>
      </subFamily>

